app/controllers/orders_controller.rb

  def create
    order_params = order_params() # Ensure params are permitted

    order = Order.new(customer_name: order_params[:customer_name], status: 'pending', total_amount: 0)

    order_params[:pizzas].each do |pizza_params|
      pizza = Pizza.find_by(id: pizza_params[:pizza_id])
      crust = Crust.find_by(id: pizza_params[:crust_id])

      return render json: { error: 'Invalid pizza or crust ID' }, status: :unprocessable_entity unless pizza && crust

      order_item = order.order_items.build(pizza: pizza, crust: crust, size: pizza_params[:size], quantity: 1)

      if pizza_params[:topping_ids].present?
        toppings = Topping.where(id: pizza_params[:topping_ids])
        order_item.toppings << toppings
      end
    end

    order_params[:sides]&.each do |side_data|
      side = Side.find_by(id: side_data[:side_id])
      order.order_sides.build(side: side, quantity: side_data[:quantity]) if side
    end

    if order.save!
---
SELECT `pizzas`.* FROM `pizzas` WHERE `pizzas`.`id` = 1 LIMIT 1
SELECT `crusts`.* FROM `crusts` WHERE `crusts`.`id` = 2 LIMIT 1
SELECT `toppings`.* FROM `toppings` WHERE `toppings`.`id` IN (3, 2)
INSERT INTO `order_items` (`order_id`, `pizza_id`, `topping_id`, `side_id`, `quantity`, `created_at`, `updated_at`, `crust_id`, `size`, `total_amount`) VALUES (7, 1, NULL, NULL, 1, '2025-02-02 17:44:46.301241', '2025-02-02 17:44:46.301241', 1, 'Medium', 245.0)
INSERT INTO `orders` (`customer_name`, `status`, `total_amount`, `created_at`, `updated_at`) VALUES ('John Doe', 'pending', 325, '2025-02-02 03:50:04.537610', '2025-02-02 03:50:04.537610')
INSERT INTO `order_item_toppings` (`order_item_id`, `topping_id`, `created_at`, `updated_at`) VALUES (7, 1, '2025-02-02 17:48:14.379284', '2025-02-02 17:48:14.379284')
SELECT `sides`.* FROM `sides` WHERE `sides`.`id` = 1 LIMIT 1
INSERT INTO `order_items` (`order_id`, `pizza_id`, `topping_id`, `side_id`, `quantity`, `created_at`, `updated_at`, `crust_id`, `size`) VALUES (2, 1, NULL, NULL, 1, '2025-02-02 17:06:14.369963', '2025-02-02 17:06:14.369963', 1, 'Medium')
INSERT INTO `order_sides` (`order_id`, `side_id`, `quantity`, `created_at`, `updated_at`) VALUES (2, 1, 2, '2025-02-03 07:04:27.004086', '2025-02-03 07:04:27.004086')
INSERT INTO `orders` (`customer_name`, `status`, `total_amount`, `created_at`, `updated_at`) VALUES ('John Doe', 'pending', 0, '2025-02-02 17:06:14.318827', '2025-02-02 17:06:14.318827')