app/models/order.rb

  def check_inventory
    inventory_errors = []

    # Check inventory for pizzas and crusts
    order_items.each do |item|
      # Check pizza inventory
      pizza_inventory = Inventory.find_by(item_type: 'Pizza', item_id: item.pizza_id)
      if pizza_inventory.nil? || pizza_inventory.quantity < item.quantity
        inventory_errors << "Not enough inventory for pizza: #{item.pizza.name}"
      end

      # Check crust inventory
      crust_inventory = Inventory.find_by(item_type: 'Crust', item_id: item.crust.id)
      if crust_inventory.nil? || crust_inventory.quantity < item.quantity
        inventory_errors << "Not enough inventory for crust: #{item.crust.name}"
      end

      # Check toppings inventory
      item.toppings.each do |topping|
        topping_inventory = Inventory.find_by(item_type: 'Topping', item_id: topping.id)
        if topping_inventory.nil? || topping_inventory.quantity < item.quantity
          inventory_errors << "Not enough inventory for topping: #{topping.name}"
        end
      end
    end

    # Check inventory for side orders
    order_sides.each do |side|
      side_inventory = Inventory.find_by(item_type: 'Side', item_id: side.side_id)
---
SELECT `inventories`.* FROM `inventories` WHERE `inventories`.`item_type` = 'Pizza' AND `inventories`.`item_id` = 1 LIMIT 1
SELECT `inventories`.* FROM `inventories` WHERE `inventories`.`item_type` = 'Crust' AND `inventories`.`item_id` = 1 LIMIT 1
SELECT `inventories`.* FROM `inventories` WHERE `inventories`.`item_type` = 'Side' AND `inventories`.`item_id` = 1 LIMIT 1

  def confirm_order!
    return false unless valid?

    # Reduce inventory
    order_items.each do |item|
      inventory = Inventory.find_by(item_type: 'Pizza', item_id: item.pizza_id)

      inventory.update(quantity: inventory.quantity - 1)

      inventory = Inventory.find_by(item_type: 'Crust', item_id: item.crust_id)
      inventory.update(quantity: inventory.quantity - 1)

      item.toppings.each do |topping|
        inventory = Inventory.find_by(item_type: 'Topping', item_id: topping.id)
        inventory.update(quantity: inventory.quantity - 1)
      end
    end

    order_sides.each do |side|
      inventory = Inventory.find_by(item_type: 'Side', item_id: side.side_id)
      inventory.update(quantity: inventory.quantity - 1)
---
SELECT `inventories`.* FROM `inventories` WHERE `inventories`.`item_type` = 'Pizza' AND `inventories`.`item_id` = 1 LIMIT 1
UPDATE `orders` SET `orders`.`status` = 'confirmed', `orders`.`updated_at` = '2025-02-02 18:12:16.088921' WHERE `orders`.`id` = 9
UPDATE `inventories` SET `inventories`.`quantity` = 98, `inventories`.`updated_at` = '2025-02-03 07:04:27.010651' WHERE `inventories`.`id` = 1
SELECT `inventories`.* FROM `inventories` WHERE `inventories`.`item_type` = 'Crust' AND `inventories`.`item_id` = 1 LIMIT 1
UPDATE `inventories` SET `inventories`.`quantity` = 98, `inventories`.`updated_at` = '2025-02-03 07:04:27.014248' WHERE `inventories`.`id` = 17
SELECT `inventories`.* FROM `inventories` WHERE `inventories`.`item_type` = 'Topping' AND `inventories`.`item_id` = 2 LIMIT 1
UPDATE `inventories` SET `inventories`.`quantity` = 98, `inventories`.`updated_at` = '2025-02-03 07:04:27.021082' WHERE `inventories`.`id` = 8
SELECT `inventories`.* FROM `inventories` WHERE `inventories`.`item_type` = 'Side' AND `inventories`.`item_id` = 1 LIMIT 1
UPDATE `orders` SET `orders`.`status` = 'confirmed', `orders`.`updated_at` = '2025-02-03 07:04:27.035949' WHERE `orders`.`id` = 2
UPDATE `inventories` SET `inventories`.`quantity` = 98, `inventories`.`updated_at` = '2025-02-03 07:04:27.030953' WHERE `inventories`.`id` = 15